In [1]:
import pandas as pd

In [31]:
df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie',"Alice"],
    'Age': [25, 30, 35,50]
})

In [6]:
df.to_csv('output.csv', index=False)

In [8]:
df.head()  # Display the first few rows of the DataFrame

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [7]:
pd.read_csv('output.csv')

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [9]:
df.info()  # Display DataFrame information

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 180.0+ bytes

In [10]:
df.describe()  # Get summary statistics of the DataFrame

        Age
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

In [11]:
df.columns  # List all columns in the DataFrame

Index(['Name', 'Age'], dtype='object')

In [13]:
df['Age']

0    25
1    30
2    35
Name: Age, dtype: int64

In [20]:
df.isnull()  # Check for missing values in the DataFrame

    Name    Age
0  False  False
1  False  False
2  False  False
3  False   True

In [16]:
df.isnull().sum()  # Count missing values in each column

Name    0
Age     0
dtype: int64

In [21]:
df.fillna(0)

      Name   Age
0    Alice  25.0
1      Bob  30.0
2  Charlie  35.0
3    ankur   0.0

In [23]:
df.dropna()  # Drop rows with missing values

      Name   Age
0    Alice  25.0
1      Bob  30.0
2  Charlie  35.0

In [26]:
df.duplicated()  # Check for duplicate rows

0    False
1    False
2    False
3    False
dtype: bool

In [27]:
df.groupby('Age').count()  # Group by 'Age' and count occurrences

      Name
Age
25.0     1
30.0     1
35.0     1

In [32]:
df.groupby('Name').mean()  # Group by 'Name' and calculate the mean of other columns

          Age
Name
Alice    37.5
Bob      30.0
Charlie  35.0

In [33]:
pd.merge(df, df, on='Name', how='inner')  # Merge DataFrames on 'Name' column

      Name  Age_x  Age_y
0    Alice     25     25
1    Alice     25     50
2      Bob     30     30
3  Charlie     35     35
4    Alice     50     25
5    Alice     50     50

In [34]:
pd.concat([df, df], axis=0)  # Concatenate DataFrames vertically

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3    Alice   50
0    Alice   25
1      Bob   30
2  Charlie   35
3    Alice   50

In [37]:
df.insert(2, 'NewColumn', [1, None, 3, None])  # Insert a new column at index 2

In [38]:
df

      Name  Age  NewColumn
0    Alice   25        1.0
1      Bob   30        NaN
2  Charlie   35        3.0
3    Alice   50        NaN

In [39]:
df_clean = df.dropna()  # Drop rows with missing values

In [40]:
df_clean

      Name  Age  NewColumn
0    Alice   25        1.0
2  Charlie   35        3.0

In [41]:
grouped = df.groupby('Name')['Age'].mean() # Group by 'Name' and calculate the mean of 'Age'

In [42]:
grouped

Name
Alice      37.5
Bob        30.0
Charlie    35.0
Name: Age, dtype: float64

In [45]:
sorted_df = grouped.sort_values(ascending=False)  # Sort the grouped DataFrame in descending order
sorted_df

Name
Alice      37.5
Charlie    35.0
Bob        30.0
Name: Age, dtype: float64

NameError: name 'np' is not defined

In [47]:
import numpy as np

In [48]:
data = np.arange(1,13).reshape(3,4)
df1 = pd.DataFrame(data, columns=['A','B','C','D'])

print(df1)

   A   B   C   D
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [49]:
data2 = np.arange(13,25).reshape(3,4)
df2 = pd.DataFrame(data2, columns=['E','F','G','H'])
df2

    E   F   G   H
0  13  14  15  16
1  17  18  19  20
2  21  22  23  24

In [53]:
df_combined = pd.concat([df1, df2], axis=0)
df_combined

     A     B     C     D     E     F     G     H
0  1.0   2.0   3.0   4.0   NaN   NaN   NaN   NaN
1  5.0   6.0   7.0   8.0   NaN   NaN   NaN   NaN
2  9.0  10.0  11.0  12.0   NaN   NaN   NaN   NaN
0  NaN   NaN   NaN   NaN  13.0  14.0  15.0  16.0
1  NaN   NaN   NaN   NaN  17.0  18.0  19.0  20.0
2  NaN   NaN   NaN   NaN  21.0  22.0  23.0  24.0

In [54]:
df_combined = pd.concat([df1, df2], axis=1)
df_combined

   A   B   C   D   E   F   G   H
0  1   2   3   4  13  14  15  16
1  5   6   7   8  17  18  19  20
2  9  10  11  12  21  22  23  24

In [55]:
df['Age']

0    25
1    30
2    35
3    50
Name: Age, dtype: int64

In [59]:
df['Age'].map(lambda x: x + 1)  # Increment each value in 'Age' by 1

0    26
1    31
2    36
3    51
Name: Age, dtype: int64

In [58]:
df.apply(np.sum, axis=0)  # Apply sum function to each column

Name         AliceBobCharlieAlice
Age                           140
NewColumn                     4.0
dtype: object

In [60]:
df = pd.DataFrame({
    'grade': ['A', 'B', 'C']
})

grade_map = {'A': 4, 'B': 3, 'C': 2}
df['points'] = df['grade'].map(grade_map)
print(df)

  grade  points
0     A       4
1     B       3
2     C       2

In [61]:
df = pd.DataFrame({
    'math': [80, 90, 70],
    'science': [85, 95, 75]
})

In [63]:
df['avg'] = df.apply(lambda x: (x['math']+x['science'])/2, axis=1)
df['avg']

0    82.5
1    92.5
2    72.5
Name: avg, dtype: float64